snlkuharlocal/src/Documents/ЗаявкаНаСкидки/ЗаявкаНаСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаСкидки</name>
  <basedOn>Document.УстановкаСкидок</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействителенПо</name>
    <comment>Дата окончания действия скидок</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.УстановкаСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбмена</name>
    <comment>Статус обмена</comment>
    <type>
      <types>EnumRef.СтатусыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>EnumRef.ВидыЗаявокНаСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ВидыЗаявокНаСкидки/ВидыЗаявокНаСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗаявокНаСкидки</name>
  <enumValues>
    <name>УстановкаСкидок</name>
  </enumValues>
  <enumValues>
    <name>ПродлениеСкидок</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаСкидки/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидЗаявки) Тогда
		Объект.ВидЗаявки = Перечисления.ВидыЗаявокНаСкидки.УстановкаСкидок;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура СкидкиНоменклатураПриИзмененииНаСервере(Идентификатор)
	СтрокаТаблицы = Объект.Скидки.НайтиПоИдентификатору(Идентификатор);
	Если Не СтрокаТаблицы = Неопределено Тогда
		СтрокаТаблицы.Брэнд = СтрокаТаблицы.Номенклатура.Родитель;
		Уровень = СтрокаТаблицы.Номенклатура.Уровень();
		Если Уровень=0 Тогда
			СтрокаТаблицы.ТипТовара = СтрокаТаблицы.Номенклатура;
			СтрокаТаблицы.Брэнд = Справочники.Номенклатура.ПустаяСсылка();
			СтрокаТаблицы.Модель = Справочники.Номенклатура.ПустаяСсылка();
		ИначеЕсли Уровень=1 Тогда
			СтрокаТаблицы.ТипТовара = СтрокаТаблицы.Номенклатура.Родитель;                                             
			СтрокаТаблицы.Брэнд = СтрокаТаблицы.Номенклатура;
			СтрокаТаблицы.Модель = Справочники.Номенклатура.ПустаяСсылка();
		ИначеЕсли Уровень=2 Тогда
			СтрокаТаблицы.ТипТовара = СтрокаТаблицы.Номенклатура.Родитель.Родитель;
			СтрокаТаблицы.Брэнд  = СтрокаТаблицы.Номенклатура.Родитель;
			СтрокаТаблицы.Модель = СтрокаТаблицы.Номенклатура;
		ИначеЕсли Уровень=3 Тогда
			СтрокаТаблицы.ТипТовара = СтрокаТаблицы.Номенклатура.Родитель.Родитель.Родитель;
			СтрокаТаблицы.Брэнд = СтрокаТаблицы.Номенклатура.Родитель.Родитель;
			СтрокаТаблицы.Модель = СтрокаТаблицы.Номенклатура.Родитель;                      
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СкидкиНоменклатураПриИзменении(Элемент)
	Идентификатор = Элементы.Скидки.ТекущаяСтрока;
	СкидкиНоменклатураПриИзмененииНаСервере(Идентификатор);
КонецПроцедуры
